/*
 Демонстрация цикла For с изменение на +1 с оператрорм ++
 Создайте файл с исходным кодом имя ForDemo.java
*/
class ForDemo2 { 
 public static void main (String args []) {
  int count;

 for(count = 5; count > -5; count--)
   System.out.println("Значение счетчика: " + count);
   
 System.out.print("Готово");
 }
}
